
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИтогиИАгрегатыСброситьДаты(Команда)
	ИтогиИАгрегатыСброситьДатыСервер();
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИтогиИАгрегатыСброситьДатыСервер()
	ПараметрыИтогов = Новый Структура;
	ПараметрыИтогов.Вставить("ЕстьРегистрыИтогов", Истина);
	ПараметрыИтогов.Вставить("ДатаРасчетаИтогов",  ДобавитьМесяц(ТекущаяДатаСеанса(), -12)); // Прошлый год
	
	УправлениеИтогамиИАгрегатамиСлужебный.ЗаписатьПараметрыИтоговИАгрегатов(ПараметрыИтогов);
КонецПроцедуры

#КонецОбласти
