
&НаКлиенте
Процедура КомандаСоздатьПользователяИБ(Команда)
	КомандаСоздатьПользователяИБНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаСоздатьПользователяИБНаСервере()
	ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	ПользовательИБ.АутентификацияСтандартная = Истина;
	ПользовательИБ.Имя = Объект.Пользователь;
	ПользовательИБ.ПоказыватьВСпискеВыбора = Истина;
	Для каждого Роль из Метаданные.Роли цикл
		ПользовательИБ.Роли.Добавить(Роль);		
	Конеццикла;
	ПользовательИБ.Записать(); 
КонецПроцедуры 