&НаКлиенте
Процедура ФорматированиеТекста(Команда)
	ТекстHTMLМакет = ФорматированиеТекстаНаСервере(Текст);
	ОбъектHTML=ТекстHTMLМакет;
КонецПроцедуры

&НаСервере
Функция ФорматированиеТекстаНаСервере(Текст)

	ТекстHTMLМакет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетHTML").ПолучитьТекст();
	ТекстCSSМакет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетCSS").ПолучитьТекст();	
	ТекстJSМакет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетJS").ПолучитьТекст();

	ТекстNew = СтрЗаменить(Текст,Символы.ПС,"\n"); 
	ТекстNew = СтрЗаменить(ТекстNew,"'",""""); //&quot
	ТекстHTMLМакет = СтрЗаменить(ТекстHTMLМакет,"...ТекстJS...",ТекстJSМакет);
	ТекстHTMLМакет = СтрЗаменить(ТекстHTMLМакет,"...ТекстCSS...",ТекстCSSМакет);
	ТекстHTMLМакет = СтрЗаменить(ТекстHTMLМакет,"...ТекстHTML...",ТекстNew);
	Возврат ТекстHTMLМакет;
КонецФункции


	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	
КонецПроцедуры

