
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ТабДок = ОтчетОбъект.СформироватьМакетТаблицыОтчета(Отчет.ПериодОтчета);
	
	ПолеОтчета.Очистить();
	ПолеОтчета.Вывести(ТабДок);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПриИзмененииВидаОтчета()
	
	ЭтоСтруктураБД = (Отчет.ВидОтчета = "СтруктураБД");
	Элементы.Группа2.Видимость = НЕ ЭтоСтруктураБД;
	Элементы.Группа3.Видимость = ЭтоСтруктураБД;
	
	Если Отчет.ВидОтчета = "Основной" Тогда
		Элементы.НеВыводитьИнформациюОТабличныхЧастях.Видимость = Истина;
		Элементы.ГруппаПериод.Видимость = Ложь;
	Иначе
		Элементы.НеВыводитьИнформациюОТабличныхЧастях.Видимость = Ложь;
		Элементы.ГруппаПериод.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ПолеСортировки = "КоличествоУбыв";
	Отчет.Периодичность = "МЕСЯЦ";
	
	Отчет.ВидОтчета = "Основной";
	ПриИзмененииВидаОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму(Расшифровка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаПриАктивизацииОбласти(Элемент)
	
	Сумма = 0;
	
	Для Каждого ВыделеннаяОбласть Из ПолеОтчета.ВыделенныеОбласти Цикл
		
		Для Стр = ВыделеннаяОбласть.Верх По ВыделеннаяОбласть.Низ Цикл
			Для Кол = ВыделеннаяОбласть.Лево По ВыделеннаяОбласть.Право Цикл
				
				Попытка
					Ячейка = ПолеОтчета.Область(Стр, Кол, Стр, Кол);
					Если Ячейка.СодержитЗначение Тогда
						Сумма = Сумма + Ячейка.Значение;
					КонецЕсли;
				Исключение
				КонецПопытки;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	ВыделеннаяСумма = Сумма;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	
	ПриИзмененииВидаОтчета();
	
КонецПроцедуры
