// Управляет доступностью элементов управления
//
// Параметры:
//	Нет.
//
Процедура УправлениеДиалогом()

	ЭлементыФормы.НадписьФрмИнтервалАвтосохранения.Доступность = ФрмИспользоватьАвтосохранение;
	ЭлементыФормы.ФрмИнтервалАвтосохранения.Доступность = ФрмИспользоватьАвтосохранение;

КонецПроцедуры // УправлениеДиалогом()

// Обработчик изменения флажка автосохранения
//
Процедура ИспользоватьАвтосохранениеПриИзменении(Элемент)

	Если Не ФрмИспользоватьАвтосохранение Тогда
		ФрмИнтервалАвтосохранения = 0;
	КонецЕсли;
	УправлениеДиалогом();

КонецПроцедуры // ИспользоватьАвтосохранениеПриИзменении()

// Обработчик нажатия кнопки ОК
//
Процедура КнопкаОКНажатие(Элемент)

	Если ФрмИспользоватьАвтосохранение и ФрмИнтервалАвтосохранения < 10 Тогда
		Предупреждение("Интервал автосохранения не должен быть меньше 10 секунд!");
		Возврат;
	КонецЕсли;
	
	ИспользоватьАвтосохранение = ФрмИспользоватьАвтосохранение;
	ИнтервалАвтосохранения = ФрмИнтервалАвтосохранения;
	Закрыть();

КонецПроцедуры // КнопкаОКНажатие()

// Обработчик события перед открытием формы
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	ФрмИспользоватьАвтосохранение = ИспользоватьАвтосохранение;
	ФрмИнтервалАвтосохранения = ИнтервалАвтосохранения;

	УправлениеДиалогом();

КонецПроцедуры // ПередОткрытием()
