
&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("ВажностьЗадачи",Объект.Важность);
	ДопПараметры.Вставить("ТекстПисьма",Объект.ТекстПисьма);
	ДопПараметры.Вставить("ТемаПисьма",Объект.ТемаПисьма);
	ДопПараметры.Вставить("ПользовательКому",Объект.Пользователь);
	узОбщийМодульСервер.ОтправитьПисьмо(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура Команда11(Команда)
	Команда1НаСервере();
КонецПроцедуры
