
&НаСервере
Функция КомандаВыгрузитьИзмененияИзХранилищаНаСервере()
	Приложение1с = "C:\Program Files (x86)\1cv8\8.3.7.1790\bin\1cv8.exe";
	//ТранзитнаяБазаАдрес ="D:\Test\Transit\";
	//ТранзитнаяБазаАдрес ="D:\Documents\Ivanov\Base\Transit";
	ТранзитнаяБазаАдрес = ПутьДоТранзитнойБазы;
	ТранзитнаяБазаПользователь = "UserStorage";
	ТранзитнаяБазаПароль = "123";
	ХранилищеАдрес = "D:\Storage\AlfaAuto\";
	ХранилищеПользователь = "UserStorage";
	ХранилищеПароль = "123";
	
	НомерПоследнейВерсииВХранилище = 6270;
	НачинатьСВерсии = НомерПоследнейВерсииВХранилище+1;
	
	пОбъект = РеквизитФормыВЗначение("Объект"); 
	РезультатФункции = пОбъект.ПолучитьТаблицуВерсийХранилища(Приложение1С,
																ТранзитнаяБазаАдрес,
																ТранзитнаяБазаПользователь,
																ТранзитнаяБазаПароль,
																ХранилищеАдрес,
																ХранилищеПользователь,
																ХранилищеПароль,
																НачинатьСВерсии);
																
																
	ТабДокОтчет = РезультатФункции.ТабДокОтчет;
	Возврат ТабДокОтчет;
	
	//Для Каждого ТекущаяСтрока Из ТаблицаВерсий Цикл
	//	НоваяВерсия = Справочники.ВерсииКонфигурацийХранилища.СоздатьЭлемент();	
	//	НомерВерсии = ТекущаяСтрока.НомерВерсии;
	//	Если Хранилище.ПослеВосстановления Тогда
	//		НомерВерсии = НомерВерсии + Хранилище.ПотеряноВерсий;
	//	КонецЕсли;
	//	НоваяВерсия.Код = НомерВерсии;
	//	НоваяВерсия.Владелец = Хранилище;
	//	НоваяВерсия.Пользователь = Справочники.ПользователиХранилища.ПолучитьПоНаименованию(ТекущаяСтрока.ИмяПользователя, Хранилище);
	//	НоваяВерсия.ДатаСоздания = ТекущаяСтрока.ДатаСоздания;
	//	НоваяВерсия.Комментарий = ТекущаяСтрока.Комментарий;
	//	НоваяВерсия.Записать();
	//КонецЦикла;																	
КонецФункции

&НаКлиенте
Процедура КомандаВыгрузитьИзмененияИзХранилища(Команда)
	ТабДокОтчет = КомандаВыгрузитьИзмененияИзХранилищаНаСервере();
	ТабДокОтчет.Показать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПутьДоТранзитнойБазы = "D:\Test\Transit\";
КонецПроцедуры




