Перем КонтекстЯдра;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем УтвержденияПроверкаТаблиц;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
    КонтекстЯдра = КонтекстЯдраПараметр;
    Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
    //ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
    //УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
    НаборТестов.Добавить("ТестДолжен_СложитьДваИДва");
КонецПроцедуры




//Перем ЮТест; // ссылка на экземпляр фреймворка xUnitFor1C - объект обработки UnitTestRunner

//Перем ОбработкаОбъект;
//Перем ИмяФайлаВнешнейОбработки;


//Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
//	
//	ЮТест = ЮнитТестирование;
//	
//	ВсеТесты = Новый Массив;
//	
//	ВсеТесты.Добавить("ТестДолжен_СложитьДваИДва");
//	
//	Возврат ВсеТесты;
//	
//КонецФункции

//Процедура ПередЗапускомТеста() Экспорт
//	ОбработкаОбъект = ВнешниеОбработки.Создать(ИмяФайлаВнешнейОбработки);
//	НачатьТранзакцию();
//КонецПроцедуры

//Процедура ПослеЗапускаТеста() Экспорт
//	Если ТранзакцияАктивна() Тогда
//		ОтменитьТранзакцию();
//	КонецЕсли;
//	ОбработкаОбъект = Неопределено;
//КонецПроцедуры

Процедура ТестДолжен_СложитьДваИДва() Экспорт
	Утверждения.ПроверитьРавенство(2 + 2, 4, "2 + 2, 4");
КонецПроцедуры

///////////////////////////////////////////////////////////
////Здесь будем писать наши тесты


//ИмяФайлаВнешнейОбработки = "e:\Cloud\Dev\epf\TestExample.epf";