&НаКлиенте
Процедура ФорматированиеТекста(Команда)
	ТекстHTMLМакет = ФорматированиеТекстаНаСервере(Текст);
	ТекстJS = Новый ТекстовыйДокумент;
	ПолученныйТекстJS = ПолучитьТекстJS(); 
	ТекстJS.УстановитьТекст(ПолученныйТекстJS);
	ВременныйФайлПуть=ПолучитьИмяВременногоФайла("js");
	ТекстJS.Записать(ВременныйФайлПуть);
	ТекстHTMLМакет = СтрЗаменить(ТекстHTMLМакет,"+++",ВременныйФайлПуть);

	ОбъектHTML=ТекстHTMLМакет;
	ПроцедураНаСервере();
КонецПроцедуры

&НаСервере
Функция ФорматированиеТекстаНаСервере(Текст)
	//ТекстHTML = Новый ТекстовыйДокумент;
	ТекстHTMLМакет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетHTML").ПолучитьТекст();
	ТекстHTMLМакет = СтрЗаменить(ТекстHTMLМакет,"...",Текст);
	
	//ТекстJS = Новый ТекстовыйДокумент;
	//ТекстJS.УстановитьТекст(РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетJS").ПолучитьТекст());
	//ВременныйФайлПуть=ПолучитьИмяВременногоФайла("js");
	//ТекстJS.Записать(ВременныйФайлПуть);
	//ТекстHTMLМакет = СтрЗаменить(ТекстHTMLМакет,"+++",ВременныйФайлПуть);
	//ОбъектHTML=ТекстHTMLМакет;
	Возврат ТекстHTMLМакет;
КонецФункции

&НаСервере
Функция ПолучитьТекстJS()
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетJS12").ПолучитьТекст();
КонецФункции	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	
КонецПроцедуры

&НаСервере
Процедура  ПроцедураНаСервере()
	
КонецПроцедуры	



