// Хранит таблицу значений - состав показателей отчета.
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ, хранящий данные отчета
Перем мСохраненныйДок Экспорт;

// Следующие переменные хранят границы
// периода построения отчета
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;

Перем мСчетчикСтраниц Экспорт; // флажок на форме выбора страниц, если Истина, то пересчет автоматический убрать
Перем мАвтоВыборКодов Экспорт; // для флажка "отключить выбор значений из списка"

Перем мВерсияФормы Экспорт;

Перем мПериодичность Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;

Перем мЗаписьЗапрещена Экспорт;

Перем мИнтервалАвтосохранения Экспорт;

Перем мРезультатПоиска Экспорт;// таблица с результатами поиска
Перем мСчетчикиСтраницПриПоиске Экспорт;// таблица со счетчиками номеров листов при поиске
Перем мТаблицаФормОтчета Экспорт;
Перем мЗаписываетсяНовыйДокумент Экспорт;
Перем мВариант Экспорт;

Перем мФормыИФорматы Экспорт;
Перем мВерсияОтчета Экспорт;

Перем мПечатьБезШтрихкодаРазрешена Экспорт;

Перем мЧтоОчищать Экспорт;

Перем СвойстваЗаполненияОтчета Экспорт;

Перем мПроверятьСоотношенияПриПечатиИВыгрузки Экспорт;

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция ОпределитьФорматВДеревеФормИФорматов(Форма, Версия, ДатаПриказа = '00010101', НомерПриказа = "",
			ДатаНачалаДействия = Неопределено, ДатаОкончанияДействия = Неопределено, ИмяОбъекта = "", Описание = "")
	
	НовСтр = Форма.Строки.Добавить();
	НовСтр.Код = СокрЛП(Версия);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ?(ДатаНачалаДействия = Неопределено, Форма.ДатаНачалаДействия, ДатаНачалаДействия);
	НовСтр.ДатаОкончанияДействия = ?(ДатаОкончанияДействия = Неопределено, Форма.ДатаОкончанияДействия, ДатаОкончанияДействия);
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция СтрокаЧГ0(ИсходноеЧисло) Экспорт // враппер
	
	Возврат РегламентированнаяОтчетность.СтрокаЧГ0(ИсходноеЧисло);
	
КонецФункции


//+ Иванов А.Б. 2016-04-15
Функция ивПолучитЗапросДанныеДляЗаполнения(ДопПараметры) Экспорт 
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = ивПолучитЗапросДанныеДляЗаполнения_ТекстЗапроса();

	Запрос.УстановитьПараметр("ИспользоватьОтборПоПодразделению", ЗначениеЗаполнено(ДопПараметры.ПодразделениеОрганизации));
	Запрос.УстановитьПараметр("ВидДвижения_Расход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ДатаНачалаКвартала", ДопПараметры.ДатаНачалаКвартала);
	Запрос.УстановитьПараметр("ДатаОкончанияКвартала", ДопПараметры.ДатаОкончанияКвартала);
	//+ Иванов А.Б. 2016-07-11	
	Запрос.УстановитьПараметр("ДатаОкончанияКварталаПлюс30Дней", ДопПараметры.ДатаОкончанияКварталаПлюс30Дней);
	//- Иванов А.Б. 2016-07-11
	Запрос.УстановитьПараметр("Организация", ДопПараметры.Организация);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ДопПараметры.ПодразделениеОрганизации);

	
	
	Возврат Запрос; 
КонецФункции //ПолучитьТЗДанныеДляЗаполнения()
//- Иванов А.Б. 2016-04-15

//+ Иванов А.Б. 2016-07-11
Функция ивПолучитЗапросДанныеДляЗаполнения_ТекстЗапроса() 
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
	|	РегламентированныйПроизводственныйКалендарь.ВидДня
	|ПОМЕСТИТЬ ВТПроизводственныйКалендарьПредв
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаНачалаКвартала И &ДатаОкончанияКварталаПлюс30Дней
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПроизводственныйКалендарьПредв.ДатаКалендаря КАК ДатаКалендаряРабочийДень
	|ПОМЕСТИТЬ ВТРабочиеДни
	|ИЗ
	|	ВТПроизводственныйКалендарьПредв КАК ВТПроизводственныйКалендарьПредв
	|ГДЕ
	|	ВТПроизводственныйКалендарьПредв.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПроизводственныйКалендарьПредв.ДатаКалендаря,
	|	ВТПроизводственныйКалендарьПредв.ВидДня,
	|	МИНИМУМ(ВТРабочиеДни.ДатаКалендаряРабочийДень) КАК ДатаКалендаряСледующийРабочийДень
	|ПОМЕСТИТЬ ВТПроизводственныйКалендарь
	|ИЗ
	|	ВТПроизводственныйКалендарьПредв КАК ВТПроизводственныйКалендарьПредв
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочиеДни КАК ВТРабочиеДни
	|		ПО ВТПроизводственныйКалендарьПредв.ДатаКалендаря <= ВТРабочиеДни.ДатаКалендаряРабочийДень
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПроизводственныйКалендарьПредв.ДатаКалендаря,
	|	ВТПроизводственныйКалендарьПредв.ВидДня
	|;
	|
	|ВЫБРАТЬ
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.ФизЛицо,
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.МесяцНалоговогоПериода,
	|	ВЫБОР
	|		КОГДА ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПеречислениеЗП
	|			ТОГДА КОНЕЦПЕРИОДА(ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.МесяцНалоговогоПериода, МЕСЯЦ)
	|		ИНАЧЕ ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа
	|	КОНЕЦ КАК ДатаФактическогоПолученияДохода,
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа КАК ДатаУдержанияНалога,
	|	ВЫБОР
	|		КОГДА ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивСрокПеречислениеНалога = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА КОНЕЦПЕРИОДА(ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа, МЕСЯЦ)
	|		ИНАЧЕ ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивСрокПеречислениеНалога
	|	КОНЕЦ КАК СрокПеречислениеНалога,
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка КАК Регистратор,
	|	СУММА(ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Сумма) КАК CуммаУдержанногоНалога,
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПеречислениеЗП КАК ПеречислениеЗП
	|ПОМЕСТИТЬ ВТПеречислениеНДФЛВБюджетДанныеДокумента
	|ИЗ
	|	Документ.ПеречислениеНДФЛвБюджет.СотрудникиОрганизации КАК ПеречислениеНДФЛвБюджетСотрудникиОрганизации
	|ГДЕ
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.Организация = &Организация
	|	И ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.Проведен
	|	И ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПодразделениеОрганизации = &ПодразделениеОрганизации
	|	И ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа МЕЖДУ &ДатаНачалаКвартала И &ДатаОкончанияКвартала
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.ФизЛицо,
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПодразделениеОрганизации,
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа,
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивСрокПеречислениеНалога,
	|	ВЫБОР
	|		КОГДА ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПеречислениеЗП
	|			ТОГДА КОНЕЦПЕРИОДА(ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа, МЕСЯЦ)
	|		ИНАЧЕ ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа
	|	КОНЕЦ,
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка,
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПеречислениеЗП,
	|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.МесяцНалоговогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПеречислениеНДФЛВБюджетДанныеДокумента.ФизЛицо,
	|	ВТПеречислениеНДФЛВБюджетДанныеДокумента.ПодразделениеОрганизации,
	|	ВТПеречислениеНДФЛВБюджетДанныеДокумента.МесяцНалоговогоПериода,
	|	ВТПеречислениеНДФЛВБюджетДанныеДокумента.ДатаФактическогоПолученияДохода,
	|	ВТПеречислениеНДФЛВБюджетДанныеДокумента.ДатаУдержанияНалога,
	|	ВЫБОР КОГДА ВТПроизводственныйКалендарь.ВидДня <> ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий) ТОГДА
	|		ВТПроизводственныйКалендарь.ДатаКалендаряСледующийРабочийДень	
	|	ИНАЧЕ
	|		ВТПеречислениеНДФЛВБюджетДанныеДокумента.СрокПеречислениеНалога
	|	КОНЕЦ КАК СрокПеречислениеНалога,
	|	ВТПеречислениеНДФЛВБюджетДанныеДокумента.Регистратор,
	|	ВТПеречислениеНДФЛВБюджетДанныеДокумента.CуммаУдержанногоНалога,
	|	ВТПеречислениеНДФЛВБюджетДанныеДокумента.ПеречислениеЗП,
	|	ВТПроизводственныйКалендарь.ДатаКалендаря,
	|	ВТПроизводственныйКалендарь.ВидДня,
	|	ВТПроизводственныйКалендарь.ДатаКалендаряСледующийРабочийДень
	|ПОМЕСТИТЬ ВТПеречислениеНДФЛВБюджетПредв
	|ИЗ
	|	ВТПеречислениеНДФЛВБюджетДанныеДокумента КАК ВТПеречислениеНДФЛВБюджетДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПроизводственныйКалендарь КАК ВТПроизводственныйКалендарь
	//+ Иванов А.Б. 2016-07-11
	//|		ПО ВТПеречислениеНДФЛВБюджетДанныеДокумента.СрокПеречислениеНалога = ВТПроизводственныйКалендарь.ДатаКалендаря
	|		ПО НАЧАЛОПЕРИОДА(ВТПеречислениеНДФЛВБюджетДанныеДокумента.СрокПеречислениеНалога,ДЕНЬ) = ВТПроизводственныйКалендарь.ДатаКалендаря
	//- Иванов А.Б. 2016-07-11
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Регистратор,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПримененныйВычет КАК СуммаСтандартныхВычетов
	|ПОМЕСТИТЬ ВТСтандартныеВычетыПредв
	|ИЗ
	|	РегистрНакопления.НДФЛПредоставленныеСтандартныеВычетыФизЛиц КАК НДФЛПредоставленныеСтандартныеВычетыФизЛиц
	|ГДЕ
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация = &Организация
	|	И НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода МЕЖДУ &ДатаНачалаКвартала И &ДатаОкончанияКвартала
	|	И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоПодразделению
	|				ТОГДА (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо, НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации) В
	|						(ВЫБРАТЬ
	|							ВТПеречислениеНДФЛВБюджетПредв.ФизЛицо,
	|							ВТПеречислениеНДФЛВБюджетПредв.ПодразделениеОрганизации
	|						ИЗ
	|							ВТПеречислениеНДФЛВБюджетПредв КАК ВТПеречислениеНДФЛВБюджетПредв)
	|			ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо В
	|					(ВЫБРАТЬ
	|						ВТПеречислениеНДФЛВБюджетПредв.ФизЛицо
	|					ИЗ
	|						ВТПеречислениеНДФЛВБюджетПредв КАК ВТПеречислениеНДФЛВБюджетПредв)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛИмущественныеВычетыФизлиц.Период,
	|	НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	НДФЛИмущественныеВычетыФизлиц.Организация,
	|	НДФЛИмущественныеВычетыФизлиц.ФизЛицо,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный,
	|	НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации,
	|	НДФЛИмущественныеВычетыФизлиц.Регистратор,
	|	НДФЛИмущественныеВычетыФизлиц.Размер КАК СуммаИмущественныхВычетов
	|ПОМЕСТИТЬ ВТИмущественныеВычетыПредв
	|ИЗ
	|	РегистрНакопления.НДФЛИмущественныеВычетыФизлиц КАК НДФЛИмущественныеВычетыФизлиц
	|ГДЕ
	|	НДФЛИмущественныеВычетыФизлиц.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ) МЕЖДУ &ДатаНачалаКвартала И &ДатаОкончанияКвартала
	|	И НДФЛИмущественныеВычетыФизлиц.ВидДвижения = &ВидДвижения_Расход
	|	И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоПодразделению
	|				ТОГДА (НДФЛИмущественныеВычетыФизлиц.ФизЛицо, НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации) В
	|						(ВЫБРАТЬ
	|							ВТПеречислениеНДФЛВБюджетПредв.ФизЛицо,
	|							ВТПеречислениеНДФЛВБюджетПредв.ПодразделениеОрганизации
	|						ИЗ
	|							ВТПеречислениеНДФЛВБюджетПредв КАК ВТПеречислениеНДФЛВБюджетПредв)
	|			ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.ФизЛицо В
	|					(ВЫБРАТЬ
	|						ВТПеречислениеНДФЛВБюджетПредв.ФизЛицо
	|					ИЗ
	|						ВТПеречислениеНДФЛВБюджетПредв КАК ВТПеречислениеНДФЛВБюджетПредв)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПеречислениеНДФЛВБюджетПредв.МесяцНалоговогоПериода,
	|	ВТПеречислениеНДФЛВБюджетПредв.ДатаФактическогоПолученияДохода,
	|	ВТПеречислениеНДФЛВБюджетПредв.ДатаУдержанияНалога,
	|	ВТПеречислениеНДФЛВБюджетПредв.СрокПеречислениеНалога,
	|	ВТПеречислениеНДФЛВБюджетПредв.ПеречислениеЗП,
	|	СУММА(ВТПеречислениеНДФЛВБюджетПредв.CуммаУдержанногоНалога) КАК CуммаУдержанногоНалога
	|ПОМЕСТИТЬ ВТПеречислениеНДФЛВБюджет
	|ИЗ
	|	ВТПеречислениеНДФЛВБюджетПредв КАК ВТПеречислениеНДФЛВБюджетПредв
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПеречислениеНДФЛВБюджетПредв.ПеречислениеЗП,
	|	ВТПеречислениеНДФЛВБюджетПредв.ДатаУдержанияНалога,
	|	ВТПеречислениеНДФЛВБюджетПредв.ДатаФактическогоПолученияДохода,
	|	ВТПеречислениеНДФЛВБюджетПредв.МесяцНалоговогоПериода,
	|	ВТПеречислениеНДФЛВБюджетПредв.СрокПеречислениеНалога
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтандартныеВычетыПредв.МесяцНалоговогоПериода,
	|	СУММА(ВТСтандартныеВычетыПредв.СуммаСтандартныхВычетов) КАК СуммаСтандартныхВычетов
	|ПОМЕСТИТЬ ВТСтандартныеВычеты
	|ИЗ
	|	ВТСтандартныеВычетыПредв КАК ВТСтандартныеВычетыПредв
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтандартныеВычетыПредв.МесяцНалоговогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИмущественныеВычетыПредв.МесяцНалоговогоПериода,
	|	СУММА(ВТИмущественныеВычетыПредв.СуммаИмущественныхВычетов) КАК СуммаИмущественныхВычетов
	|ПОМЕСТИТЬ ВТИмущественныеВычеты
	|ИЗ
	|	ВТИмущественныеВычетыПредв КАК ВТИмущественныеВычетыПредв
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТИмущественныеВычетыПредв.МесяцНалоговогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПеречислениеНДФЛВБюджет.МесяцНалоговогоПериода,
	|	ВТПеречислениеНДФЛВБюджет.ДатаФактическогоПолученияДохода,
	|	ВТПеречислениеНДФЛВБюджет.ДатаУдержанияНалога КАК ДатаУдержанияНалога,
	|	ВТПеречислениеНДФЛВБюджет.СрокПеречислениеНалога,
	|	ВТПеречислениеНДФЛВБюджет.ПеречислениеЗП,
	|	ВТПеречислениеНДФЛВБюджет.CуммаУдержанногоНалога,
	|	(ВЫРАЗИТЬ(ВТПеречислениеНДФЛВБюджет.CуммаУдержанногоНалога * 100 / 13 КАК ЧИСЛО(15, 2))) + ЕСТЬNULL(ВТСтандартныеВычеты.СуммаСтандартныхВычетов, 0) + ЕСТЬNULL(ВТИмущественныеВычеты.СуммаИмущественныхВычетов, 0) КАК СуммаФактическиПолученногоДохода,
	|	ЕСТЬNULL(ВТСтандартныеВычеты.СуммаСтандартныхВычетов, 0) КАК СуммаСтандартныхВычетов,
	|	ЕСТЬNULL(ВТИмущественныеВычеты.СуммаИмущественныхВычетов, 0) КАК СуммаИмущественныхВычетов
	|ПОМЕСТИТЬ ВТРезультат
	|ИЗ
	|	ВТПеречислениеНДФЛВБюджет КАК ВТПеречислениеНДФЛВБюджет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтандартныеВычеты КАК ВТСтандартныеВычеты
	|		ПО ВТПеречислениеНДФЛВБюджет.МесяцНалоговогоПериода = ВТСтандартныеВычеты.МесяцНалоговогоПериода
	|			И (ВТПеречислениеНДФЛВБюджет.ПеречислениеЗП)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИмущественныеВычеты КАК ВТИмущественныеВычеты
	|		ПО ВТПеречислениеНДФЛВБюджет.МесяцНалоговогоПериода = ВТИмущественныеВычеты.МесяцНалоговогоПериода
	|			И (ВТПеречислениеНДФЛВБюджет.ПеречислениеЗП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРезультат.МесяцНалоговогоПериода,
	|	ВТРезультат.ДатаФактическогоПолученияДохода,
	|	ВТРезультат.ДатаУдержанияНалога КАК ДатаУдержанияНалога,
	|	ВТРезультат.СрокПеречислениеНалога,
	|	ВТРезультат.ПеречислениеЗП,
	|	ВТРезультат.CуммаУдержанногоНалога,
	|	ВТРезультат.СуммаФактическиПолученногоДохода,
	|	ВТРезультат.СуммаСтандартныхВычетов,
	|	ВТРезультат.СуммаИмущественныхВычетов
	|ИЗ
	|	ВТРезультат КАК ВТРезультат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаУдержанияНалога

	|";
	Возврат ТекстЗапроса;
	//Старый запрос ниже
	//ВЫБРАТЬ
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.ФизЛицо,
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПодразделениеОрганизации КАК ПодразделениеОрганизации,
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.МесяцНалоговогоПериода,
	//|	ВЫБОР
	//|		КОГДА ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПеречислениеЗП
	//|			ТОГДА КОНЕЦПЕРИОДА(ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.МесяцНалоговогоПериода, МЕСЯЦ)
	//|		ИНАЧЕ ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа
	//|	КОНЕЦ КАК ДатаФактическогоПолученияДохода,
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа КАК ДатаУдержанияНалога,
	//|	ВЫБОР
	//|		КОГДА ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивСрокПеречислениеНалога = ДАТАВРЕМЯ(1, 1, 1)
	//|			ТОГДА КОНЕЦПЕРИОДА(ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа, МЕСЯЦ)
	//|		ИНАЧЕ ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивСрокПеречислениеНалога
	//|	КОНЕЦ КАК СрокПеречислениеНалога,
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка КАК Регистратор,
	//|	СУММА(ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Сумма) КАК CуммаУдержанногоНалога,
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПеречислениеЗП КАК ПеречислениеЗП
	//|ПОМЕСТИТЬ ВТПеречислениеНДФЛВБюджетПредв
	//|ИЗ
	//|	Документ.ПеречислениеНДФЛвБюджет.СотрудникиОрганизации КАК ПеречислениеНДФЛвБюджетСотрудникиОрганизации
	//|ГДЕ
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.Организация = &Организация
	//|	И ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.Проведен
	//|	И ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПодразделениеОрганизации = &ПодразделениеОрганизации
	//|	И ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа МЕЖДУ &ДатаНачалаКвартала И &ДатаОкончанияКвартала
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.ФизЛицо,
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПодразделениеОрганизации,
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа,
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивСрокПеречислениеНалога,
	//|	ВЫБОР
	//|		КОГДА ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПеречислениеЗП
	//|			ТОГДА КОНЕЦПЕРИОДА(ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа, МЕСЯЦ)
	//|		ИНАЧЕ ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ДатаПлатежа
	//|	КОНЕЦ,
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка,
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.ивПеречислениеЗП,
	//|	ПеречислениеНДФЛвБюджетСотрудникиОрганизации.Ссылка.МесяцНалоговогоПериода
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо,
	//|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация,
	//|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода,
	//|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	//|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации,
	//|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Регистратор,
	//|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПримененныйВычет КАК СуммаСтандартныхВычетов
	//|ПОМЕСТИТЬ ВТСтандартныеВычетыПредв
	//|ИЗ
	//|	РегистрНакопления.НДФЛПредоставленныеСтандартныеВычетыФизЛиц КАК НДФЛПредоставленныеСтандартныеВычетыФизЛиц
	//|ГДЕ
	//|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация = &Организация
	//|	И НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода МЕЖДУ &ДатаНачалаКвартала И &ДатаОкончанияКвартала
	//|	И ВЫБОР
	//|			КОГДА &ИспользоватьОтборПоПодразделению
	//|				ТОГДА (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо, НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации) В
	//|						(ВЫБРАТЬ
	//|							ВТПеречислениеНДФЛВБюджетПредв.ФизЛицо,
	//|							ВТПеречислениеНДФЛВБюджетПредв.ПодразделениеОрганизации
	//|						ИЗ
	//|							ВТПеречислениеНДФЛВБюджетПредв КАК ВТПеречислениеНДФЛВБюджетПредв)
	//|			ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо В
	//|					(ВЫБРАТЬ
	//|						ВТПеречислениеНДФЛВБюджетПредв.ФизЛицо
	//|					ИЗ
	//|						ВТПеречислениеНДФЛВБюджетПредв КАК ВТПеречислениеНДФЛВБюджетПредв)
	//|		КОНЕЦ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	НДФЛИмущественныеВычетыФизлиц.Период,
	//|	НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	//|	НДФЛИмущественныеВычетыФизлиц.Организация,
	//|	НДФЛИмущественныеВычетыФизлиц.ФизЛицо,
	//|	НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный,
	//|	НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации,
	//|	НДФЛИмущественныеВычетыФизлиц.Регистратор,
	//|	НДФЛИмущественныеВычетыФизлиц.Размер КАК СуммаИмущественныхВычетов
	//|ПОМЕСТИТЬ ВТИмущественныеВычетыПредв
	//|ИЗ
	//|	РегистрНакопления.НДФЛИмущественныеВычетыФизлиц КАК НДФЛИмущественныеВычетыФизлиц
	//|ГДЕ
	//|	НДФЛИмущественныеВычетыФизлиц.Организация = &Организация
	//|	И НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ) МЕЖДУ &ДатаНачалаКвартала И &ДатаОкончанияКвартала
	//|	И НДФЛИмущественныеВычетыФизлиц.ВидДвижения = &ВидДвижения_Расход
	//|	И ВЫБОР
	//|			КОГДА &ИспользоватьОтборПоПодразделению
	//|				ТОГДА (НДФЛИмущественныеВычетыФизлиц.ФизЛицо, НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации) В
	//|						(ВЫБРАТЬ
	//|							ВТПеречислениеНДФЛВБюджетПредв.ФизЛицо,
	//|							ВТПеречислениеНДФЛВБюджетПредв.ПодразделениеОрганизации
	//|						ИЗ
	//|							ВТПеречислениеНДФЛВБюджетПредв КАК ВТПеречислениеНДФЛВБюджетПредв)
	//|			ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.ФизЛицо В
	//|					(ВЫБРАТЬ
	//|						ВТПеречислениеНДФЛВБюджетПредв.ФизЛицо
	//|					ИЗ
	//|						ВТПеречислениеНДФЛВБюджетПредв КАК ВТПеречислениеНДФЛВБюджетПредв)
	//|		КОНЕЦ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТПеречислениеНДФЛВБюджетПредв.МесяцНалоговогоПериода,
	//|	ВТПеречислениеНДФЛВБюджетПредв.ДатаФактическогоПолученияДохода,
	//|	ВТПеречислениеНДФЛВБюджетПредв.ДатаУдержанияНалога,
	//|	ВТПеречислениеНДФЛВБюджетПредв.СрокПеречислениеНалога,
	//|	ВТПеречислениеНДФЛВБюджетПредв.ПеречислениеЗП,
	//|	СУММА(ВТПеречислениеНДФЛВБюджетПредв.CуммаУдержанногоНалога) КАК CуммаУдержанногоНалога
	//|ПОМЕСТИТЬ ВТПеречислениеНДФЛВБюджет
	//|ИЗ
	//|	ВТПеречислениеНДФЛВБюджетПредв КАК ВТПеречислениеНДФЛВБюджетПредв
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТПеречислениеНДФЛВБюджетПредв.ПеречислениеЗП,
	//|	ВТПеречислениеНДФЛВБюджетПредв.ДатаУдержанияНалога,
	//|	ВТПеречислениеНДФЛВБюджетПредв.ДатаФактическогоПолученияДохода,
	//|	ВТПеречислениеНДФЛВБюджетПредв.МесяцНалоговогоПериода,
	//|	ВТПеречислениеНДФЛВБюджетПредв.СрокПеречислениеНалога
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтандартныеВычетыПредв.МесяцНалоговогоПериода,
	//|	СУММА(ВТСтандартныеВычетыПредв.СуммаСтандартныхВычетов) КАК СуммаСтандартныхВычетов
	//|ПОМЕСТИТЬ ВТСтандартныеВычеты
	//|ИЗ
	//|	ВТСтандартныеВычетыПредв КАК ВТСтандартныеВычетыПредв
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтандартныеВычетыПредв.МесяцНалоговогоПериода
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТИмущественныеВычетыПредв.МесяцНалоговогоПериода,
	//|	СУММА(ВТИмущественныеВычетыПредв.СуммаИмущественныхВычетов) КАК СуммаИмущественныхВычетов
	//|ПОМЕСТИТЬ ВТИмущественныеВычеты
	//|ИЗ
	//|	ВТИмущественныеВычетыПредв КАК ВТИмущественныеВычетыПредв
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТИмущественныеВычетыПредв.МесяцНалоговогоПериода
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТПеречислениеНДФЛВБюджет.МесяцНалоговогоПериода,
	//|	ВТПеречислениеНДФЛВБюджет.ДатаФактическогоПолученияДохода,
	//|	ВТПеречислениеНДФЛВБюджет.ДатаУдержанияНалога КАК ДатаУдержанияНалога,
	//|	ВТПеречислениеНДФЛВБюджет.СрокПеречислениеНалога,
	//|	ВТПеречислениеНДФЛВБюджет.ПеречислениеЗП,
	//|	ВТПеречислениеНДФЛВБюджет.CуммаУдержанногоНалога,
	//|	(ВЫРАЗИТЬ(ВТПеречислениеНДФЛВБюджет.CуммаУдержанногоНалога * 100 / 13 КАК ЧИСЛО(15, 2))) + ЕСТЬNULL(ВТСтандартныеВычеты.СуммаСтандартныхВычетов, 0) + ЕСТЬNULL(ВТИмущественныеВычеты.СуммаИмущественныхВычетов, 0) КАК СуммаФактическиПолученногоДохода,
	//|	ЕСТЬNULL(ВТСтандартныеВычеты.СуммаСтандартныхВычетов, 0) КАК СуммаСтандартныхВычетов,
	//|	ЕСТЬNULL(ВТИмущественныеВычеты.СуммаИмущественныхВычетов, 0) КАК СуммаИмущественныхВычетов
	//|ПОМЕСТИТЬ ВТРезультат
	//|ИЗ
	//|	ВТПеречислениеНДФЛВБюджет КАК ВТПеречислениеНДФЛВБюджет
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтандартныеВычеты КАК ВТСтандартныеВычеты
	//|		ПО ВТПеречислениеНДФЛВБюджет.МесяцНалоговогоПериода = ВТСтандартныеВычеты.МесяцНалоговогоПериода
	//|			И (ВТПеречислениеНДФЛВБюджет.ПеречислениеЗП)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИмущественныеВычеты КАК ВТИмущественныеВычеты
	//|		ПО ВТПеречислениеНДФЛВБюджет.МесяцНалоговогоПериода = ВТИмущественныеВычеты.МесяцНалоговогоПериода
	//|			И (ВТПеречислениеНДФЛВБюджет.ПеречислениеЗП)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТРезультат.МесяцНалоговогоПериода,
	//|	ВТРезультат.ДатаФактическогоПолученияДохода,
	//|	ВТРезультат.ДатаУдержанияНалога КАК ДатаУдержанияНалога,
	//|	ВТРезультат.СрокПеречислениеНалога,
	//|	ВТРезультат.ПеречислениеЗП,
	//|	ВТРезультат.CуммаУдержанногоНалога,
	//|	ВТРезультат.СуммаФактическиПолученногоДохода,
	//|	ВТРезультат.СуммаСтандартныхВычетов,
	//|	ВТРезультат.СуммаИмущественныхВычетов
	//|ИЗ
	//|	ВТРезультат КАК ВТРезультат
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДатаУдержанияНалога

КонецФункции //фнмПолучитЗапросДанныеДляЗаполнения_ТекстЗапроса()
//- Иванов А.Б. 2016-07-11

//+ Иванов А.Б. 2016-07-11
Процедура ивПроверимЕстьЛиЗаписиВПроизводственномКалендаре(ДопПараметры,Отказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК ДнейВРегистре
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаНачалаКвартала И &ДатаОкончанияКварталаПлюс30Дней";
	
	Запрос.УстановитьПараметр("ДатаНачалаКвартала", ДопПараметры.ДатаНачалаКвартала);
	Запрос.УстановитьПараметр("ДатаОкончанияКварталаПлюс30Дней", ДопПараметры.ДатаОкончанияКварталаПлюс30Дней);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДнейДолжноБытьЗаполнено = (КонецДня(ДопПараметры.ДатаОкончанияКварталаПлюс30Дней)- ДопПараметры.ДатаНачалаКвартала + 1) / 86400;
	ДнейВРегистре = 0;
	Пока Выборка.Следующий() Цикл
		ДнейВРегистре = Выборка.ДнейВРегистре;
	КонецЦикла;
	
	Если ДнейДолжноБытьЗаполнено <> ДнейВРегистре Тогда
		Отказ = Истина;
		Сообщить("Ошибка! необходимо заполнить [Производственный календарь] за период: "
			+" с "+ Формат(ДопПараметры.ДатаНачалаКвартала,"ДФ=dd.MM.yyyy")
			+" по "+ Формат(ДопПараметры.ДатаОкончанияКварталаПлюс30Дней,"ДФ=dd.MM.yyyy")
			);
	Конецесли;
КонецПроцедуры //фнмПроверимЕстьЛиЗаписиВПроизводственномКалендаре(ДатаОкончанияКварталаПлюс30Дней,Отказ)
//- Иванов А.Б. 2016-07-11


//+ Иванов А.Б. 2016-03-23
Функция ивВыполнитьЗапрос(Запрос,ИмяТЧ,ТекстЗапроса = Неопределено) Экспорт 
	ВТЗапрос = Новый Запрос();
	ВТЗапрос.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	Если ТекстЗапроса = Неопределено Тогда		
		ВТЗапрос.Текст = 
			"ВЫБРАТЬ *
			|ИЗ
			|	"+ИмяТЧ+" КАК ивТестоваяТЧ";
	Иначе
		ВТЗапрос.Текст = ТекстЗапроса;		
	Конецесли;		
	Возврат ВТЗапрос.Выполнить().Выгрузить();
КонецФункции //ВыполнитьЗапрос(Запрос,ИмяТЧ)
//- Иванов А.Б. 2016-03-23


мЧтоОчищать = "Расчет";

мФормыИФорматы = РегламентированнаяОтчетность.НовоеДеревоФормИФорматов();

ФормаОтчета2016Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1151099", '2015-10-14', "ММВ-7-11/450@", "ФормаОтчета2016Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2016Кв1, "5.01");

ОписаниеТиповСтрока15  = ОбщегоНазначенияЗК.ПолучитьОписаниеТиповСтроки(15);
ОписаниеТиповСтрока50  = ОбщегоНазначенияЗК.ПолучитьОписаниеТиповСтроки(50);

мТаблицаСоставПоказателей    = Новый ТаблицаЗначений;
мТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",     ОписаниеТиповСтрока50);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",   ОписаниеТиповСтрока50);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",     ОписаниеТиповСтрока50);
мТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",     ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",      ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСтруктуре", ОписаниеТиповСтрока50);

мСтруктураВариантыЗаполнения = Новый Структура;

ОписаниеТиповСтрока = ОбщегоНазначенияЗК.ПолучитьОписаниеТиповСтроки(254);

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

мТаблицаФормОтчета = Новый ТаблицаЗначений;
мТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
мТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
мТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
мТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2016Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу ФНС России от 14.10.2015 № ММВ-7-11/450@";
НоваяФорма.ДатаНачалоДействия = '2016-01-01';
НоваяФорма.ДатаКонецДействия  = ОбщегоНазначенияЗК.ПустоеЗначениеТипа(Тип("Дата"));
