
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Выборка = РегистрыСведений.бпсЗадачиПоБизнесПроцессам.Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = Выборка.ПолучитьМенеджерЗаписи();
		Запись.Прочитать();
		
		ЗадачаСсылка = Запись.Задача;
		БизнесПроцесс = ЗадачаСсылка.БизнесПроцесс;
		Запись.БизнесПроцесс = БизнесПроцесс;
		Запись.ДатаБизнесПроцесса = БизнесПроцесс.Дата;
		Запись.ПредметСогласования = БизнесПроцесс.ПредметСогласования;
		Запись.Записать();
	Конеццикла;
	Сообщить("Обработано");	
КонецПроцедуры
