&НаКлиенте
Функция  ВыполнитьЗапрос(Команда)
	// Создаем HTTPСоединение, указываем сервер
	СерверДляЗапроса = "api.github.com";
	ТекстДляЗапроса = "/repos/BlizD/Tasks/releases/latest";
	HTTPЗапрос = Новый HTTPЗапрос(ТекстДляЗапроса);
	ssl = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(СерверДляЗапроса,,,,,,ssl);
	//ВременныйФайлПуть=ПолучитьИмяВременногоФайла();
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);


	JSON = Новый ЧтениеJSON;
	JSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
	Данные = ПрочитатьJSON(JSON);
	Сообщить("Версия: "+Данные.tag_name+" Количество загрузок:" + Данные.assets[0].download_count);
КонецФункции

&НаКлиенте
Процедура СтатистикаСкачивания(Команда)
	СерверДляЗапроса = "api.github.com";
	ТекстДляЗапроса = "/repos/BlizD/Tasks/releases";
	HTTPЗапрос = Новый HTTPЗапрос(ТекстДляЗапроса);
	ssl = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(СерверДляЗапроса,,,,,,ssl);
	//ВременныйФайлПуть=ПолучитьИмяВременногоФайла();
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);


	JSON = Новый ЧтениеJSON;
	JSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
	ДанныеПоРелизам = ПрочитатьJSON(JSON);
	//Сообщить("Версия: "+Данные.tag_name+" Количество загрузок:" + Данные.assets[0].download_count);	
	ИтогоЗагрузок = 0;
	Для каждого СтрокаДанныеПоРелизам из ДанныеПоРелизам цикл
		ИмяРелиза = СтрокаДанныеПоРелизам.tag_name;
		КоличествоЗагрузок = 0;
		Для каждого Строка_assets из СтрокаДанныеПоРелизам.assets цикл
			КоличествоЗагрузок = Строка_assets.download_count;		
		Конеццикла;
		Сообщить("Версия: "+ИмяРелиза+" Количество загрузок: " + КоличествоЗагрузок);
		ИтогоЗагрузок = ИтогоЗагрузок + КоличествоЗагрузок;
	Конеццикла;
	Сообщить("ИтогоЗагрузок: " +ИтогоЗагрузок); 
КонецПроцедуры


//https://api.github.com/users/Blizd
//https://api.github.com/users/BlizD/repos - репозитории юзера
//GET /repos/:owner/:repo/releases/:id
//https://api.github.com/repos/BlizD/Tasks/releases/latest
	
